reddit/app/models/user.rb

  def reset_session_token!
    self.session_token = SecureRandom::urlsafe_base64(16)
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "yGZk1mV4KP0fqY1b2gXbHg"], ["updated_at", "2018-10-23 19:02:13.935905"], ["id", 1]]