reddit/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "hello"], ["description", "it's me, James."], ["user_id", 1], ["created_at", "2018-10-23 19:16:32.531701"], ["updated_at", "2018-10-23 19:16:32.531701"]]
---
  def create
    @s = Sub.new(sub_params)
    @s.user_id = current_user.id
    if @s.save

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @s = Sub.find(params[:id])